In [14]:
import csv
import pandas as pd
from sqlalchemy import create_engine

In [15]:
income1 = pd.read_csv('https://usc.data.socrata.com/api/views/kygc-fzgm/rows.csv?accessType=DOWNLOAD')
income1.head()

,Policy Area,Dataset,Variable,Year,Amount,Tract,Tract Number,Neighborhood,GEOID,Location,Row ID,Date
0,Employment & Income,Income,Median Household Income,2013,74971.0,"Census Tract 4321.01, Los Angeles County, Cali...",432101,Temple City,1400000US06037432101,"(34.095852, -118.0428825)",Median_Household_Income_2013_1400000US06037432101,01/01/2013
1,Employment & Income,Income,Median Household Income,2013,30759.0,"Census Tract 2422, Los Angeles County, California",242200,Watts,1400000US06037242200,"(33.948204, -118.238625)",Median_Household_Income_2013_1400000US06037242200,01/01/2013
2,Employment & Income,Income,Median Household Income,2011,57219.0,"Census Tract 2719.02, Los Angeles County, Cali...",271902,Mar Vista,1400000US06037271902,"(34.009731, -118.4316705)",Median_Household_Income_2011_1400000US06037271902,01/01/2011
3,Employment & Income,Income,Median Household Income,2013,81700.0,"Census Tract 4313, Los Angeles County, California",431300,Mayflower Village,1400000US06037431300,"(34.1248395, -118.007363)",Median_Household_Income_2013_1400000US06037431300,01/01/2013
4,Employment & Income,Income,Median Household Income,2011,101783.0,"Census Tract 4805, Los Angeles County, California",480500,South Pasadena,1400000US06037480500,"(34.1074225, -118.14498)",Median_Household_Income_2011_1400000US06037480500,01/01/2011

In [16]:
income1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16400 entries, 0 to 16399
Data columns (total 12 columns):
Policy Area     16400 non-null object
Dataset         16400 non-null object
Variable        16400 non-null object
Year            16400 non-null int64
Amount          16178 non-null float64
Tract           16400 non-null object
Tract Number    16400 non-null int64
Neighborhood    16400 non-null object
GEOID           16400 non-null object
Location        16400 non-null object
Row ID          16400 non-null object
Date            16400 non-null object
dtypes: float64(1), int64(2), object(9)
memory usage: 1.5+ MB

In [17]:
income1 = income1.dropna(how="any")
income1.head()
income1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 16178 entries, 0 to 16399
Data columns (total 12 columns):
Policy Area     16178 non-null object
Dataset         16178 non-null object
Variable        16178 non-null object
Year            16178 non-null int64
Amount          16178 non-null float64
Tract           16178 non-null object
Tract Number    16178 non-null int64
Neighborhood    16178 non-null object
GEOID           16178 non-null object
Location        16178 non-null object
Row ID          16178 non-null object
Date            16178 non-null object
dtypes: float64(1), int64(2), object(9)
memory usage: 1.6+ MB

In [18]:
income1 = income1.rename(columns=
                         {"Year": "year", "Amount": "amount", "Tract Number": "tract_id", "Neighborhood": "neighborhood"})
income1.head()

,Policy Area,Dataset,Variable,year,amount,Tract,tract_id,neighborhood,GEOID,Location,Row ID,Date
0,Employment & Income,Income,Median Household Income,2013,74971.0,"Census Tract 4321.01, Los Angeles County, Cali...",432101,Temple City,1400000US06037432101,"(34.095852, -118.0428825)",Median_Household_Income_2013_1400000US06037432101,01/01/2013
1,Employment & Income,Income,Median Household Income,2013,30759.0,"Census Tract 2422, Los Angeles County, California",242200,Watts,1400000US06037242200,"(33.948204, -118.238625)",Median_Household_Income_2013_1400000US06037242200,01/01/2013
2,Employment & Income,Income,Median Household Income,2011,57219.0,"Census Tract 2719.02, Los Angeles County, Cali...",271902,Mar Vista,1400000US06037271902,"(34.009731, -118.4316705)",Median_Household_Income_2011_1400000US06037271902,01/01/2011
3,Employment & Income,Income,Median Household Income,2013,81700.0,"Census Tract 4313, Los Angeles County, California",431300,Mayflower Village,1400000US06037431300,"(34.1248395, -118.007363)",Median_Household_Income_2013_1400000US06037431300,01/01/2013
4,Employment & Income,Income,Median Household Income,2011,101783.0,"Census Tract 4805, Los Angeles County, California",480500,South Pasadena,1400000US06037480500,"(34.1074225, -118.14498)",Median_Household_Income_2011_1400000US06037480500,01/01/2011

In [19]:
income = income1[["year", "amount", "tract_id", "neighborhood"]].copy()
income.head()

   year    amount  tract_id       neighborhood
0  2013   74971.0    432101        Temple City
1  2013   30759.0    242200              Watts
2  2011   57219.0    271902          Mar Vista
3  2013   81700.0    431300  Mayflower Village
4  2011  101783.0    480500     South Pasadena

In [20]:
income['id'] = income.index + 1
income.head()

   year    amount  tract_id       neighborhood  id
0  2013   74971.0    432101        Temple City   1
1  2013   30759.0    242200              Watts   2
2  2011   57219.0    271902          Mar Vista   3
3  2013   81700.0    431300  Mayflower Village   4
4  2011  101783.0    480500     South Pasadena   5

In [25]:
median_income = income[["id", "amount", "year", "tract_id"]].copy()
median_income.head()

   id    amount  year  tract_id
0   1   74971.0  2013    432101
1   2   30759.0  2013    242200
2   3   57219.0  2011    271902
3   4   81700.0  2013    431300
4   5  101783.0  2011    480500

In [22]:
neighborhoods = income[["id", "neighborhood", "tract_id"]].copy()
neighborhoods.head()

   id       neighborhood  tract_id
0   1        Temple City    432101
1   2              Watts    242200
2   3          Mar Vista    271902
3   4  Mayflower Village    431300
4   5     South Pasadena    480500

### Create database connection

In [26]:
connection_string = "root:root@localhost/income"
engine = create_engine(f'mysql+pymysql://{connection_string}')

In [27]:
# Confirm tables that are created in the database 
engine.table_names()

['median_income', 'neighborhoods']

### Load DataFrames into database

In [31]:
#Use pandas to load csv converted DataFrame into database
median_income.to_sql(name='median_income', con=engine, if_exists='append', index=False)

In [32]:
#Confirm data has been added by querying the median_household_income table
pd.read_sql_query('select * from median_income', con=engine).head()

   id    amount  year  tract_id
0   1   74971.0  2013    432101
1   2   30759.0  2013    242200
2   3   57219.0  2011    271902
3   4   81700.0  2013    431300
4   5  101783.0  2011    480500

In [33]:
#Use pandas to load csv converted DataFrame into database
neighborhoods.to_sql(name='neighborhoods', con=engine, if_exists='append', index=False)

In [34]:
#Confirm data has been added by querying the median_household_income table
pd.read_sql_query('select * from neighborhoods', con=engine).head()

   id       neighborhood  tract_id
0   1        Temple City    432101
1   2              Watts    242200
2   3          Mar Vista    271902
3   4  Mayflower Village    431300
4   5     South Pasadena    480500